hotelReservation/results/client_load_sweeps/20260331T203937Z_hotels/logs/wrk_hotels_13000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 273.315ms, rate sampling interval: 1244ms
  Thread calibration: mean lat.: 298.098ms, rate sampling interval: 1217ms
  Thread calibration: mean lat.: 288.015ms, rate sampling interval: 1119ms
  Thread calibration: mean lat.: 232.651ms, rate sampling interval: 1061ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.79s     2.00s    8.11s    61.01%
    Req/Sec     3.06k    40.75     3.15k    69.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.71s 
 75.000%    5.41s 
 90.000%    6.46s 
 99.000%    8.11s 
 99.900%    9.13s 
 99.990%    9.63s 
 99.999%    9.74s 
100.000%    9.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.315     0.000000            1         1.00
    1133.567     0.100000       134646         1.11
    1789.951     0.200000       269412         1.25
    2392.063     0.300000       404216         1.43
    3031.039     0.400000       539025         1.67
    3708.927     0.500000       673420         2.00
    4057.087     0.550000       740874         2.22
    4419.583     0.600000       808319         2.50
    4751.359     0.650000       875398         2.86
    5079.039     0.700000       942546         3.33
    5410.815     0.750000      1010796         4.00
    5550.079     0.775000      1043746         4.44
    5709.823     0.800000      1077517         5.00
    5885.951     0.825000      1111518         5.71
    6070.271     0.850000      1144760         6.67
    6254.591     0.875000      1178480         8.00
    6352.895     0.887500      1195350         8.89
    6455.295     0.900000      1212358        10.00
    6561.791     0.912500      1228647        11.43
    6688.767     0.925000      1245745        13.33
    6832.127     0.937500      1262338        16.00
    6926.335     0.943750      1270805        17.78
    7020.543     0.950000      1279129        20.00
    7122.943     0.956250      1287549        22.86
    7254.015     0.962500      1296122        26.67
    7397.375     0.968750      1304543        32.00
    7479.295     0.971875      1308759        35.56
    7569.407     0.975000      1312901        40.00
    7663.615     0.978125      1317048        45.71
    7741.439     0.981250      1321378        53.33
    7864.319     0.984375      1325481        64.00
    7933.951     0.985938      1327557        71.11
    8007.679     0.987500      1329725        80.00
    8069.119     0.989062      1331770        91.43
    8138.751     0.990625      1333893       106.67
    8257.535     0.992188      1335924       128.00
    8331.263     0.992969      1336987       142.22
    8413.183     0.993750      1338056       160.00
    8519.679     0.994531      1339157       182.86
    8601.599     0.995313      1340148       213.33
    8675.327     0.996094      1341178       256.00
    8708.095     0.996484      1341711       284.44
    8749.055     0.996875      1342265       320.00
    8798.207     0.997266      1342781       365.71
    8896.511     0.997656      1343291       426.67
    8945.663     0.998047      1343846       512.00
    8962.047     0.998242      1344080       568.89
    8986.623     0.998437      1344425       640.00
    9011.199     0.998633      1344615       731.43
    9076.735     0.998828      1344880       853.33
    9142.271     0.999023      1345145      1024.00
    9166.847     0.999121      1345295      1137.78
    9199.615     0.999219      1345411      1280.00
    9224.191     0.999316      1345542      1462.86
    9256.959     0.999414      1345664      1706.67
    9297.919     0.999512      1345808      2048.00
    9314.303     0.999561      1345863      2275.56
    9330.687     0.999609      1345921      2560.00
    9347.071     0.999658      1345977      2925.71
    9371.647     0.999707      1346042      3413.33
    9428.991     0.999756      1346108      4096.00
    9453.567     0.999780      1346161      4551.11
    9461.759     0.999805      1346180      5120.00
    9494.527     0.999829      1346216      5851.43
    9527.295     0.999854      1346240      6826.67
    9568.255     0.999878      1346273      8192.00
    9609.215     0.999890      1346291      9102.22
    9641.983     0.999902      1346306     10240.00
    9691.135     0.999915      1346328     11702.86
    9699.327     0.999927      1346343     13653.33
    9707.519     0.999939      1346360     16384.00
    9715.711     0.999945      1346375     18204.44
    9715.711     0.999951      1346375     20480.00
    9723.903     0.999957      1346390     23405.71
    9723.903     0.999963      1346390     27306.67
    9732.095     0.999969      1346405     32768.00
    9732.095     0.999973      1346405     36408.89
    9732.095     0.999976      1346405     40960.00
    9740.287     0.999979      1346424     46811.43
    9740.287     0.999982      1346424     54613.33
    9740.287     0.999985      1346424     65536.00
    9740.287     0.999986      1346424     72817.78
    9740.287     0.999988      1346424     81920.00
    9740.287     0.999989      1346424     93622.86
    9740.287     0.999991      1346424    109226.67
    9748.479     0.999992      1346431    131072.00
    9748.479     0.999993      1346431    145635.56
    9748.479     0.999994      1346431    163840.00
    9748.479     0.999995      1346431    187245.71
    9748.479     0.999995      1346431    218453.33
    9748.479     0.999996      1346431    262144.00
    9756.671     0.999997      1346432    291271.11
    9756.671     0.999997      1346432    327680.00
    9764.863     0.999997      1346433    374491.43
    9764.863     0.999998      1346433    436906.67
    9781.247     0.999998      1346434    524288.00
    9781.247     0.999998      1346434    582542.22
    9781.247     0.999998      1346434    655360.00
    9789.439     0.999999      1346435    748982.86
    9789.439     0.999999      1346435    873813.33
    9789.439     0.999999      1346435   1048576.00
    9789.439     0.999999      1346435   1165084.44
    9789.439     0.999999      1346435   1310720.00
    9805.823     0.999999      1346436   1497965.71
    9805.823     1.000000      1346436          inf
#[Mean    =     3788.588, StdDeviation   =     1997.429]
#[Max     =     9797.632, Total count    =      1346436]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1463334 requests in 2.00m, 369.26MB read
Requests/sec:  12194.54  
Transfer/sec:      3.08MB