hotelReservation/results/client_load_sweeps/20260331T203937Z_hotels/logs/wrk_hotels_17000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 1433.690ms, rate sampling interval: 5246ms
  Thread calibration: mean lat.: 1446.528ms, rate sampling interval: 5255ms
  Thread calibration: mean lat.: 1434.130ms, rate sampling interval: 5242ms
  Thread calibration: mean lat.: 1466.134ms, rate sampling interval: 5300ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    18.20s     8.88s   33.65s    57.97%
    Req/Sec     3.07k    12.89     3.10k    76.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.19s 
 75.000%   25.87s 
 90.000%   30.52s 
 99.000%   33.65s 
 99.900%   34.67s 
 99.990%   35.23s 
 99.999%   35.42s 
100.000%   35.45s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2340.863     0.000000            1         1.00
    5926.911     0.100000       134925         1.11
    9011.199     0.200000       269621         1.25
   12042.239     0.300000       404537         1.43
   15081.471     0.400000       539253         1.67
   18186.239     0.500000       674451         2.00
   19693.567     0.550000       741764         2.22
   21233.663     0.600000       809352         2.50
   22790.143     0.650000       876346         2.86
   24313.855     0.700000       943683         3.33
   25870.335     0.750000      1011720         4.00
   26623.999     0.775000      1045056         4.44
   27410.431     0.800000      1078970         5.00
   28164.095     0.825000      1112207         5.71
   28966.911     0.850000      1145920         6.67
   29736.959     0.875000      1179904         8.00
   30130.175     0.887500      1196508         8.89
   30523.391     0.900000      1213729        10.00
   30900.223     0.912500      1230120        11.43
   31309.823     0.925000      1247670        13.33
   31686.655     0.937500      1263970        16.00
   31883.263     0.943750      1272669        17.78
   32079.871     0.950000      1280907        20.00
   32276.479     0.956250      1289215        22.86
   32489.471     0.962500      1298015        26.67
   32686.079     0.968750      1306001        32.00
   32800.767     0.971875      1310396        35.56
   32915.455     0.975000      1314601        40.00
   33046.527     0.978125      1319052        45.71
   33161.215     0.981250      1322833        53.33
   33308.671     0.984375      1327288        64.00
   33390.591     0.985938      1329422        71.11
   33472.511     0.987500      1331344        80.00
   33587.199     0.989062      1333790        91.43
   33685.503     0.990625      1335954       106.67
   33783.807     0.992188      1337758       128.00
   33849.343     0.992969      1338876       142.22
   33914.879     0.993750      1339767       160.00
   33980.415     0.994531      1340679       182.86
   34078.719     0.995313      1341978       213.33
   34177.023     0.996094      1343002       256.00
   34209.791     0.996484      1343350       284.44
   34275.327     0.996875      1343940       320.00
   34340.863     0.997266      1344501       365.71
   34406.399     0.997656      1345132       426.67
   34471.935     0.998047      1345600       512.00
   34504.703     0.998242      1345848       568.89
   34537.471     0.998437      1346081       640.00
   34570.239     0.998633      1346276       731.43
   34635.775     0.998828      1346663       853.33
   34668.543     0.999023      1346787      1024.00
   34701.311     0.999121      1346879      1137.78
   34766.847     0.999219      1347099      1280.00
   34799.615     0.999316      1347196      1462.86
   34832.383     0.999414      1347269      1706.67
   34897.919     0.999512      1347398      2048.00
   34930.687     0.999561      1347459      2275.56
   34996.223     0.999609      1347578      2560.00
   35028.991     0.999658      1347665      2925.71
   35028.991     0.999707      1347665      3413.33
   35061.759     0.999756      1347722      4096.00
   35094.527     0.999780      1347759      4551.11
   35127.295     0.999805      1347792      5120.00
   35160.063     0.999829      1347840      5851.43
   35192.831     0.999854      1347876      6826.67
   35225.599     0.999878      1347916      8192.00
   35225.599     0.999890      1347916      9102.22
   35258.367     0.999902      1347937     10240.00
   35258.367     0.999915      1347937     11702.86
   35291.135     0.999927      1347966     13653.33
   35323.903     0.999939      1348003     16384.00
   35323.903     0.999945      1348003     18204.44
   35323.903     0.999951      1348003     20480.00
   35323.903     0.999957      1348003     23405.71
   35323.903     0.999963      1348003     27306.67
   35356.671     0.999969      1348025     32768.00
   35356.671     0.999973      1348025     36408.89
   35356.671     0.999976      1348025     40960.00
   35356.671     0.999979      1348025     46811.43
   35356.671     0.999982      1348025     54613.33
   35389.439     0.999985      1348034     65536.00
   35389.439     0.999986      1348034     72817.78
   35389.439     0.999988      1348034     81920.00
   35422.207     0.999989      1348047     93622.86
   35422.207     0.999991      1348047    109226.67
   35422.207     0.999992      1348047    131072.00
   35422.207     0.999993      1348047    145635.56
   35422.207     0.999994      1348047    163840.00
   35422.207     0.999995      1348047    187245.71
   35422.207     0.999995      1348047    218453.33
   35422.207     0.999996      1348047    262144.00
   35422.207     0.999997      1348047    291271.11
   35422.207     0.999997      1348047    327680.00
   35422.207     0.999997      1348047    374491.43
   35422.207     0.999998      1348047    436906.67
   35422.207     0.999998      1348047    524288.00
   35422.207     0.999998      1348047    582542.22
   35422.207     0.999998      1348047    655360.00
   35454.975     0.999999      1348049    748982.86
   35454.975     1.000000      1348049          inf
#[Mean    =    18202.883, StdDeviation   =     8883.225]
#[Max     =    35422.208, Total count    =      1348049]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1469139 requests in 2.00m, 370.70MB read
Requests/sec:  12242.63  
Transfer/sec:      3.09MB